# 39). Создайте программу для игры с конфетами человек против человека.

# Условие задачи:
# На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
# Все конфеты оппонента достаются сделавшему последний ход.

# Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?

# a) Добавьте игру против бота

# цикл от 1 до 2021
    # ход рандомно от 0 до 1 (либо да либо нет)
    # в зависимости от того кто ходит, выбор либо ввести с клавиатуры число                             либо рандомно от 1 до 28
    # вычесть из 2021 полученное число

    # следующий ход зависит от того кто начал, повторить действия:
        #выбор либо ввести с клавиатуры число либо рандомно от 1 до 28
        # вычесть из 2021 полученное число

    # до тех пор пока 2021 не станет меньше 28


# b) Подумайте, как наделить бота "интеллектом"                                                            либо рандомно от 1 до 28
# https://dtf.ru/flood/179981-python-napishem-igru-v-spichki-s-hardkornym-ii
