# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

my_list = [2, 4, 7, 9, 5, 3, 6, 7, 4, 4, 4, 7, 7, 7]
print(list(set(my_list)))
